=====模型信息=====
gpu_n:1
data_name:LargeData
train_data_num:1006148
dev_data_num:55816
feature:{'name': 'mel', 'kwargs': {'fft_s': 0.128, 'hop_s': 0.016, 'target_sr': 8000, 'n_mels': 128}}
label_type:pinyin
ModelOBJ_name:CNN1d_CTC_PinYin_Sample_lessDropout
model_name:CNN1d_CTC_PinYin_Sample_lessDropout
max_epochs:500
batch_size:64
load_weight_path:None
main_save_dir:saved_models
cur_model_savedir:saved_models/CNN1d_CTC_PinYin_Sample_lessDropout/LargeData/(gpu_n=1)(feature_name=mel)(label_type=pinyin)
=================
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
padded_datas (InputLayer)       (None, None, 128)    0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 96)     135264      padded_datas[0][0]               
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 96)     384         conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, None, 96)     0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 256)    123136      max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 256)    1024        conv1d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, None, 256)    0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 384)    295296      max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, None, 384)    0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, None, 384)    442752      dropout_1[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, None, 384)    0           conv1d_4[0][0]                   
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, None, 256)    295168      dropout_2[0][0]                  
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, None, 256)    0           conv1d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, 256)    1024        dropout_3[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, None, 256)    0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, None, 2048)   526336      max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, None, 2048)   0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, None, 2036)   4171764     dropout_4[0][0]                  
__________________________________________________________________________________________________
softmax_out (Activation)        (None, None, 2036)   0           dense_2[0][0]                    
__________________________________________________________________________________________________
padded_labels (InputLayer)      (None, None)         0                                            
__________________________________________________________________________________________________
data_lengths (InputLayer)       (None, 1)            0                                            
__________________________________________________________________________________________________
label_lengths (InputLayer)      (None, 1)            0                                            
__________________________________________________________________________________________________
CTC_loss (Lambda)               (None, 1)            0           softmax_out[0][0]                
                                                                 padded_labels[0][0]              
                                                                 data_lengths[0][0]               
                                                                 label_lengths[0][0]              
==================================================================================================
Total params: 5,992,148
Trainable params: 5,990,932
Non-trainable params: 1,216
__________________________________________________________________________________________________
