=====模型信息=====
gpu_n:1
data_name:MagicData
train_data_num:100
dev_data_num:100
feature:{'name': 'mel', 'kwargs': {'fft_s': 0.128, 'hop_s': 0.016, 'target_sr': 8000, 'n_mels': 128}}
label_type:phone
ModelOBJ_name:CNN1d_CTC_Phone_RealSample
model_name:CNN1d_CTC_Phone_RealSample
max_epochs:5
batch_size:64
load_weight_path:None
main_save_dir:debug/saved_models
cur_model_savedir:debug/saved_models/CNN1d_CTC_Phone_RealSample/MagicData/(gpu_n=1)(feature_name=mel)(label_type=phone)_4
=================
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
padded_datas (InputLayer)       (None, None, 128)    0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 96)     61536       padded_datas[0][0]               
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 96)     384         conv1d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, None, 96)     0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 128)    36992       max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 128)    512         conv1d_2[0][0]                   
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 256)    98560       batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, None, 256)    65792       conv1d_3[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, None, 256)    0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, None, 228)    58596       dropout_1[0][0]                  
__________________________________________________________________________________________________
softmax_out (Activation)        (None, None, 228)    0           dense_2[0][0]                    
__________________________________________________________________________________________________
padded_labels (InputLayer)      (None, None)         0                                            
__________________________________________________________________________________________________
data_lengths (InputLayer)       (None, 1)            0                                            
__________________________________________________________________________________________________
label_lengths (InputLayer)      (None, 1)            0                                            
__________________________________________________________________________________________________
CTC_loss (Lambda)               (None, 1)            0           softmax_out[0][0]                
                                                                 padded_labels[0][0]              
                                                                 data_lengths[0][0]               
                                                                 label_lengths[0][0]              
==================================================================================================
Total params: 322,372
Trainable params: 321,924
Non-trainable params: 448
__________________________________________________________________________________________________
